Revit 2026 API

# BuiltInFailuresGeometryFailures Class

---

Failures about GeometryFailures.

SystemObject Autodesk.Revit.DBBuiltInFailuresGeometryFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class GeometryFailures
```
```vb
Public NotInheritable Class GeometryFailures
```
```cpp
public ref class GeometryFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type GeometryFailures = class end
```

The BuiltInFailuresGeometryFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotFindClosest | Cannot find closest points within lines. |
|  | ConvertFaceRegionsToFacesCrashed | Failed to replace an instance face with its face regions. |
|  | ConvertFaceRegionsToFacesFailed | Failed to replace an instance face with its face regions. |
|  | CurveAndSurfaceDoNotIntersect | Curve and Surface do not intersect. |
|  | CurveDriverError | Element's internal join data is corrupt. |
|  | CurveProjectTooShort | The projection of the line in this view is too short to create a new Line |
|  | ElementIsTooThin | [Element] is too thin. |
|  | ElementTooSmall | Element is too small on screen |
|  | FailedReplaceCurveElemCurveDriver | Failed to replace curve elem curve driver. |
|  | FailedUpdateCurveChain | Failed to update curve chain. |
|  | FailToConvertLine | Unable to convert lines |
|  | LineArcTangentFailure | Can't keep arc element and straight line element tangent. |
|  | OffsetFaceFailed | Failed to offset the face. |
|  | PolygonSegmentTooShort | Polygon segment too short |
|  | SiteInvisible | Topographic elements are not visible in your current view. You can modify View Range settings in the view's Properties or Visibility settings in Visibility/Graphics. |
|  | SuccessToConvertLine | Success to convert lines |
|  | SymbolicLineInvalidPlane | Symbolic Element refers to a Work Plane with unacceptable normal. |
|  | TooManyFacesEdges | This family instance has too many [Edges and Faces]. Remove unnecessary geometry or split the instance into multiple instances. |

#### Reference

Autodesk.Revit.DB Namespace